{"modelTopology":{"class_name":"Model","config":{"name":"model42","layers":[{"name":"user","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"user"},"inbound_nodes":[]},{"name":"item","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"item"},"inbound_nodes":[]},{"name":"userEmbeddingLayer","class_name":"Embedding","config":{"input_dim":10,"output_dim":3,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"userEmbeddingLayer","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["user",0,0,{}]]]},{"name":"itemEmbeddingLayer","class_name":"Embedding","config":{"input_dim":10,"output_dim":3,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"itemEmbeddingLayer","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["item",0,0,{}]]]},{"name":"flat1","class_name":"Flatten","config":{"name":"flat1","trainable":true},"inbound_nodes":[[["userEmbeddingLayer",0,0,{}]]]},{"name":"flat2","class_name":"Flatten","config":{"name":"flat2","trainable":true},"inbound_nodes":[[["itemEmbeddingLayer",0,0,{}]]]},{"name":"rating","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"rating","trainable":true},"inbound_nodes":[[["flat1",0,0,{}],["flat2",0,0,{}]]]}],"input_layers":[["user",0,0],["item",0,0]],"output_layers":[["rating",0,0]]},"keras_version":"tfjs-layers 3.18.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"userEmbeddingLayer/embeddings","shape":[10,3],"dtype":"float32"},{"name":"itemEmbeddingLayer/embeddings","shape":[10,3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.18.0","convertedBy":null}